# САМОСТОЯТЕЛЬНАЯ РАБОТА

# Задание 1
# вывести на экран элемент из списка

list_1 = [1, [9, 8, 7], 'f', [0, 2, 3]]


# Задание 2
# вывести на экран элемент из сообщения

message = {'content_type': 'text',
           'id': 7,
           'message_id': 7,
           'from_user': {'id': 1038344763,
                         'is_bot': False,
                         'first_name': 'Dmitry',
                         'username': 'HoloPen',
                         'last_name': None,
                         'language_code': 'ru',
                         'is_premium': True}
           }

# Задание 3
'''
Запросить у пользователя ввод двух чисел, записать их в две переменные
Написать логику:
Если первое число больше второго, вывести на экран свое имя
Иначе если два числа равны, вывести на экран свою фамилию
Иначе (else) вывести свое имя И фамилию
'''

# Задание 4
'''
Написать функцию, в которой создается список, и через цикл for у пользователя запрашивается ввод, фамилии, имени, 
отчества и каждый раз, введенные данные записываются в список
В конце вывести на экран список, а также, отдельно вывести только имя
'''
